[
    {
        "id": 1,
        "categoryId": 1,
        "name": "Apple iPhone 12 Pro 128 GB Silver",
        "price": "12 305 000",
        "shortDesc": "Apple Iphone 13 Mini 512 GB. Ushbu modelni faqat bizdan xarid qilishingiz mumkin. Eng arzon narxlarda! Iphone mini - eng ilg'or qo'sh kamera tizimi. Chidamlilikka e’tibor qarating. Raqobatdan ustun turadigan chaqmoq chipi. Yangi ultra keng burchakli kamera suratlaringizning qorong‘u joylarida ko‘proq tafsilotlarni ochib beradi. Yangi keng burchakli kamera yaxshi surat va videolar uchun 47% ko‘proq yorug‘lik oladi. Sensorli siljishli yangi optik tasvir barqarorligi, hatto harakatda bo‘lmasangiz ham, suratlarni aniq ushlab turadi.",
        "longDesc": "Apple iPhone 13 butunlay yangi, zamonaviy va ixcham dizaynda taqdim etilgan bo'lib, ko'zni qamashtiradi. Displeyning yuqori qismidagi old kamera va TrueDepth datchiklarini joylashtirish uchun mo‘ljallangan kesma 20 foizga kichikroq bo‘ldi, korpus esa bardoshli metall va shishadan yasalgan bo‘lib, mexanik shikastlanishdan himoyalangan. Uning Super Retina XDR OLED displeyi ko‘rish uchun maksimal qulaylik bilan bir qatorda ranglarning ajoyib reproduksiyasi va barcha ranglarning to‘yinganligini ta’minlaydi.\n\nQurilmaning asosiy afzalliklaridan biri innovatsion Apple A15 Bionic protsessori bo‘lib, u ikkita yuqori unumdor va to‘rtta energiya tejovchi yadroni mukammal birlashtirgan. Bunday protsessor resurs talab qiladigan o'yinlar va ilovalarning silliq va barqaror ishlashini ta'minlaydi. Bundan tashqari, u juda ko'p multimedia fayllarini o'rnatish va saqlash uchun 512 Gb o'rnatilgan xotira bilan birga keladi.\n\nQurilmaning orqa tomonida to'rtburchaklar kesim mavjud bo'lib, unda ikkita kamera joylashgan bo'lib, ular yordamida siz ajoyib sifatdagi ajoyib suratlarni olishingiz mumkin. Asosiy sensor 12 megapikselli ruxsatga va qo'shimcha keng burchakli linzaga ega. Ikkinchi sensor ham 12 megapikselli ultra keng burchakli optikaga ega, bu sizga butun manzarani suratga olishga yordam beradi. Bundan tashqari, o'rnatilgan stabilizatsiya batafsilroq fotosuratlar beradi.\n\nO'rnatilgan litiy-ion batareyasi qurilmaning kun davomida ko'p soat ishlashini ta'minlaydi. Qurilmaning dizayni simsiz va tez zaryadlash funksiyasini ham amalga oshiradi, bu esa maksimal qulaylikni ta'minlaydi.",
        "picture": "/img/AppleIphone13.jpeg"
    },
    {
        "id": 2,
        "categoryId": 1,
        "name": "Xiaomi Redmi 12 Pro 12/256GB Kulrang",
        "price": "12 673 000",
        "shortDesc": "Xiaomi 12 Pro haqiqatan ham yuqori sifatli displeyga ega, u protsessorga yukni kamaytirish uchun yangilanish tezligini 1 Gts gacha kamaytirishga qodir. U juda katta yorqinlik chegarasiga ega, bu HDR kontentini ko'rish uchun ajoyib ekanligini anglatadi. Uning kontrasti deyarli cheksizdir, bu uni birinchi marta yoqqaningizda darhol seziladi. Displey Gorilla Glass Victus shishasi bilan himoyalangan, bu juda yaxshi ekanligini isbotladi.",
        "longDesc": "DIZAYN\n\nXiaomi 12 Pro ixcham va nisbatan yengil. Uning orqa panelida siz vertikal yo'naltirilgan kamera blokini ko'rasiz. Asosiy ob'ektiv tepada, qolgan ikkitasi va chirog'i pastda joylashgan. Ushbu kompozitsiya chiroyli ko'rinadi va uyg'unlik hissi yaratadi.\n\nDeyarli butun old panelni egri display egallagan bo‘lib, u so‘nggi avlod Gorilla Glass Victus himoya oynasi bilan himoyalangan. Shuningdek, u o‘rnatilgan barmoq izi skaneri ham mavjud.\n\nDISPLAY\n\nSmartfon LTPO AMOLED matritsasi bilan nihoyatda chiroyli va ajoyib 6,73 dyuymli displey bilan jihozlangan. U 120 Gts maksimal yangilanish tezligini va 480 Gts sensorli yangilanish tezligini qo'llab-quvvatlaydi. Shuningdek, biz Micro-Lens texnologiyasi va ikkinchi avlod LTPO uchun yordam topamiz. Boshqacha qilib aytganda, Xiaomi 12 Pro vizual sifati va kam quvvat sarfi bo‘yicha bozordagi eng yaxshi displeylardan biriga ega. Tasvir suvli, tabiiy ranglar va yetarlicha yorqin. Ekran maksimal 1500 nits yorqinligini qo'llab-quvvatlaydi. Ushbu qurilma qo'lingizda bo'lsa, siz har qanday sharoitda ma'lumotni ochishda muammoga duch kelmaysiz.\n\nISHLAB CHIQISH\n\nHatto eng talabchan foydalanuvchilarning ehtiyojlarini qondirish uchun smartfon eng yuqori ko'rsatkichga ega bo'lishi kerak. Buning uchun u Qualcomm SM8450 Snapdragon 8 Gen 1 protsessori va Adreno 730 grafik tezlatkichi bilan jihozlangan. Tezkor xotira LPDDR5 tipidagi bo‘lib, modifikatsiyasiga qarab 8 yoki 12 Gb bo‘lishi mumkin. Shuningdek, siz xotira hajmini tanlashingiz mumkin - 128 yoki 256 GB. Xotira kartasi uchun uyasi yo'qligi sababli, qaysi modifikatsiya kerakligini oldindan yaxshilab o'ylab ko'rishingiz kerak.\n\nNatijada, bunday yuqori darajadagi konfiguratsiya qurilmaga barcha operatsiyalarni benuqson va havas qiladigan tezlikda bajarishga imkon beradi. Xiaomi 12 Pro oʻyin oʻynash, internetni koʻrish, turli ilovalardan foydalanish va hokazolar uchun javob beradi.\n\nKAMERALAR\n\nXiaomi 12 Pro-da biz Sony sensorlarini topamiz, bu kompaniyaning ishlab chiqarish amaliyotida biroz o'zgarganligini ko'rsatadi. Orqa tomonda biz uch kamerani ko'ramiz, ularning har biri 50 MP ruxsatga ega. Ushbu nostandart, ammo esda qolarli qaror ushbu smartfon bilan oladigan fotosuratlarning ajoyib sifati haqida gapiradi. Ular chuqurroq ranglar, kuchli kontrast va ajoyib dinamik diapazonga ega.\n\nQizig'i shundaki, deyarli barcha ishlarni asosiy kamera bajaradi. Bu Sony IMX707 sensori. Kechasi ham undan mukammal kadrlarni kutish mumkin.\n\nUltra keng burchakli kamera ilg'or texnologiyalardan foydalanadi. Dinamik diapazon bo'yicha eng yaxshi suratlarni oladi.\n\nSelfilar haqida gap ketganda, atrofingizdagilarni hayratda qoldiradigan 32 megapikselli kamera va bir qator ilg‘or surat rejimlari mavjud.\n\nBilishingiz kerakki, barcha Xiaomi 12 Pro linzalari bilan siz 4K formatida 60 kadr tezlikda video yozishingiz mumkin. Yozib olish paytida siz bir kameradan boshqasiga bemalol o'tishingiz mumkin.\n\nAVTONOM ISH\n\nSmartfon 4600 mA/soat akkumulyator bilan jihozlangan, bu Mi 11 Pro’dan 400 mA/soat kamroq. Zaryadlash texnologiyasi va batareyaning o'zi tufayli siz batareyaning mukammal ishlash muddatini kutishingiz mumkin.\n\nXiaomi 120 Vt tez zaryadlash texnologiyasini qo'llab-quvvatladi. Uning yordamida siz atigi 18 daqiqada zaryadni 0 dan 100% gacha tiklaysiz.",
        "picture": "/img/XiaomiRedmi12Pro.jpeg"
    },

    {
        "id": 3,
        "categoryId": 2,
        "name": "MSI GF65 i5-10500H 8/512GB SSD RTX3060 15.6",
        "price": "12 305 000",
        "shortDesc": "Zo'r tezlik xususiyatlariga ega displey tezkor kompyuter o'yinlarida ajoyib tasvirni taqdim etadi. Qopqoqning metall yuzasi va klaviatura atrofidagi maydon futuristik dizayn bilan uyg'unlashgan. Markaziy va grafik protsessorlarni alohida sovutish uchun 6 ta issiqlik quvurlaridan foydalanish noutbukning haddan tashqari o'yin yuklari ostida barqaror ishlashini kafolatlaydi.",
        "longDesc": "MUSIQANING HAQIQIY OVOZI\n\nHi-Res Audio bilan benuqson ovoz olamiga sho‘ng‘ib keting. Musiqani ijrochilar taqdim etmoqchi bo'lgan shaklda tinglang!",
        "picture": "/img/NoutbukMSIGF65i5.jpeg"
    },

    {
        "id": 4,
        "categoryId": 2,
        "name": "Acer Nitro-7 i7-10750 24GB/1TB SSD 6GB 15.6",
        "price": "18 170 000",
        "shortDesc": "Yorqinlikka qarshi qoplamali 15,6 dyuymli FHD IPS displeyda aniq va tiniq tasvirlar bilan o‘yinlarni batafsilroq o‘rganing. 144 Gts yangilanish tezligi va 3ms javob vaqti bilan silliq, xira o‘yinlardan rohatlaning. Endi Turbo rejimida 5,0 gigagertsgacha tezlikda ishlaydigan 10-avlod Intel protsessorlari bilan shaxsiy kompyuteringizni kuchaytiring.",
        "longDesc": "",
        "picture": "/img/NoutbukMSIGF65i5.jpeg"
    },

    {
        "id": 5,
        "categoryId": 3,
        "name": "Jeyms Klir: Atom odatlar",
        "price": "18 170 000",
        "shortDesc": "Kichik oʻzgarishlar, katta natijalar!",
        "longDesc": "﻿New York Timesʼning birinchi raqamli bestselleri. Dunyo bo'ylab 2 yilda 5 milliondan ortiq nusxada sotilgan!\n\n \n\nSizga hayotingizni o'zgartirishda muhim bo'lgan ajoyib kitobni ona tilimizda taqdim etishdan xursandmiz. \n﻿Nima maqsad qoʻyganingizdan qatʼiy nazar, ushbu kitob sizga har kuni oz-ozdan yaxshilanib borishning sinalgan dasturini taklif qiladi. Odatlarni shakllantirish boʻyicha dunyoning yetakchi ekspertlaridan bori Jeyms Klir yaxshi odatlarni shakllantirish, yomonlaridan xalos boʻlish hamda katta natijalarga olib boruvchi kichik odatlarni egallashni oʻrgatuvchi amaliy strategiyalarni ochib beradi.\n\nAgar odatlaringizni oʻzgartirishni uddasidan chiqa olmayotgan boʻlsangiz, muammo sizda emas. Muammo tizimda. Yomon odatlar takrorlanaverishining sababi siz ularni oʻzgartirishni xohlamayotganingizda emas, balki oʻzgarish uchun notoʻgʻri tizim tanlaganingizda. Siz maqsadlaringizning darajasiga koʻtarilmaysiz, bilʼaks tizimlaringiz darajasiga tushib qolasiz. Mazkur kitobda esa sizni yangi choʻqqilarga olib chiquvchi sinashta tizim bilan tanishasiz.\n\nKlir murakkab mavzularni ham kundalik hayotga va ishga osongina tatbiq qilsa boʻladigan oddiy odatlarga bogʻlab, yechim bera olishi bilan tanilgan. Kitobda u yaxshi odatlarni muqarrar, yomonlarini esa ilojsiz qilish boʻyicha tushunishga oson yoʻriqnoma yaratar ekan, biologiya, psixologiya va neyroilmdagi eng ishonchli gʻoyalarga suyanadi. Mutolaa davomida kitobxon Olimpiadadagi oltin medal sohiblari, yetakchi biznesmenlar, inson hayotini saqlab qolgan shifokorlar oʻz kasbini ustasi boʻlishda mitti odatlar ilmidan foydalangani hamda sohada eng zoʻriga aylangani haqidagi hayotiy hikoyalarini oʻqib, ruhlanadi.\n\nQanday qilib:\n\n- yangi odatlar uchun vaqt ajratishni (hatto qiladigan ishlaringiz oshib-toshib ketganda ham);\n\n- ishtiyoqsizlik va irodasizlikni yengishni;\n\n- atrof-muhitni muvaffaqiyatga erishishni osonlashtiradigan qilib tartiblashni;\n\n- yoʻldan adashganda ortga qayta olishni va boshqa koʻplab narsalarni oʻrganing.\n\n“Atom odatlar” oʻsish va muvaffaqiyat haqidagi fikrlaringizni oʻzgartiradi hamda sizga odatlaringizni oʻzgartirishda zarur boʻlgan qurol va strategiyalarni taqdim etadi. Xoh chempionatda gʻalaba qozonishni istayotgan jamoa boʻling, xoh sohaga qayta jon berishga umid qilgan tashkilot, yoki shunchaki chekishni tashlashni, ozishni, stressni kamaytirishni yoki yana boshqa bir maqsadga erishishni xohlayotgan oddiy inson boʻling, bu kitob sizga naf keltirmay qolmaydi.\n\nTarjimon: Sarvinoz Qosimova\n\nMuharrir: Z. G‘ulomova\n\nMusahhihlar: Y. Mahmudov, U. Abdusalomova\n\nDizayner: A. Umarova\n\nSahifalovchi: X. Yo‘ldoshev\n\nKitob haqida OAV va mashhurlar: \n\n\"Juda amaliy va foydali kitob. Jeyms Klir odatlarning shakllanishiga oid eng asosiy ma'lumotlarni tarqatadi, shuning uchun siz kamroq narsaga e'tibor qaratib, ko'proq narsaga erishishingiz mumkin.\"\n-Mark Menson, \"Beparvolikning nozik san'ati\" kitobi muallifi\n\n\n“Jeyms Klir ko'p yillar umrini shaxsiy kamolot san'ati va odatlar fanini o'rganishga sarfladi. Ushbu qiziqarli, amaliy kitob sizga yomon tartiblarni buzish va yaxshilarini odat qilish uchun kerak bo'lgan qo'llanmadir.\"\n-Adam Grant, \"Originallar, Ber va ol\" kitobi muallifi, mashhur yozuvchi \n\n“Atom odatlari – bu bir (yoki o‘nlab) yomon odat(lar)ni tashlay olmayotganidan hafsalasi pir bo‘lgan va nihoyat salomatlik, fitnes, moliyaviy erkinlik, ajoyib munosabatlarga erishmoqchi bo‘lganlar uchun ajoyib kitob. yaxshi qo'llanma.\"\n– Medium.com nashri ",
        "picture": "/img/AtomOdatlar.jpg"
    },

    {
        "id": 6,
        "categoryId": 3,
        "name": "Uolter Ayzekson: Stiv Jobs",
        "price": "69 000",
        "shortDesc": "«Asaxiy Books» лойиҳасида яна бир ажойиб янгилик. Уолтер Айзексоннинг «Стив Жобс» асари илк маротаба ўзбек тилида чоп этилди. Замонавий дунёнинг энг йирик бизнесменларидан бири, инноватор, Apple компаниясининг асосчиси Стив Жобснинг муваффақият тарихи ҳақида ёзилган ушбу китоб бир неча йил давомида жаҳон даражасидаги бестселлерга айланиб улгурди. \nКитобда сиз отаси ташлаб кетган, онаси рад этган бола қандай қилиб дунёнинг энг катта компаниясига асос солиши тарихини ўрганасиз. Бу оғир табиатли, лекин дунёни ўзгача кўз билан кўра олган, уни ўзгартиришни хоҳлаган, информацион технологиялари революциясига сабабчи бўлган инсоннинг ҳаёти ҳақидаги китобдир.",
        "longDesc": "1-боб. Болалик. Ташлаб кетилган ва асраб олинган\n\nЎғил қилиб олиниши\n\nПол Жобс Иккинчи жаҳон урушидан кейин қирғоқ мудофаасидаги ҳарбий хизматдан бўшатилгач, хизматдошлари билан гаров ўйнайди. Улар хизмат қилган кеманинг шахсий таркиби Сан-Франциско қирғоғига ўтказилганди ва Пол икки ҳафта ичида шу ерда ўз рафиқасини топишини айтади. Қадди-қомати келишган, татуировкаларга бурканган механик-моторист Жобс актёр Жеймс Динга жуда ўхшарди. Бироқ арман эмигрантларининг хушмуомала ва қувноқ қизи Клара Агопянни жалб қилган нарса унинг ташқи кўриниши эмас эди. Шунчаки ўша кеча сайрга чиқмоқчи бўлган Клара ва дўстларининг машинаси Пол хизматдошларининг машинасидек қулай эмасди. Ўн кун ўтгач, 1946 йил мартда ёшлар унаштирилди ва шу тариқа Пол гаровда ғолиб бўлди. Никоҳ муваффақиятли бўлиб чиқди. Эр-хотин Жобслар умрининг охиригача – 40 йил бирга яшади.\nПол Рейнголд Жобснинг болалиги Висконсин штати Жермантаундаги сут фермасида ўтди. Унинг отаси ичкиликка ружу қўйганди, қўлига кўп эрк берарди, лекин, шунга қарамай, Пол беозор ва меҳрибон бола бўлиб улғайди. У мактабни ташлаб кетди, ўқишни битирмай, Ўрта Ғарб бўйлаб кезишга отланди. Механик бўлиб кун кўрди, 19 ёшида эса (сузишни билмаса-да) қирғоқ мудофаасига қабул қилинди. Жобс хизматни “Генерал М. К. Мегс” транспорт кемасида ўтказди. Бу кема Иккинчи жаҳон уруши вақтида қўшинларни Италияга, генерал Паттон ҳузурига етказиб берарди. Пол ўзини яхши механик ва ўтёқар сифатида кўрсатди, мукофотга тавсия қилинди. Унинг лавозимини ҳам оширмоқчи бўлишди, лекин хато қилиб қўйди ва шу-шу матросликдан юқорига кўтарила олмади. ",
        "picture": "/img/StivJobs.jpg"
    }
]